Tekla Open API Reference for Tekla Structures 2025
DistanceList Methods
The DistanceList type exposes the following members.
Methods
Name | Description
Add
 Adds the specified item at the end of the list.
Clear
 Clears the list.
Contains
 Determines whether the specified item is in the list.
CopyTo
 Copies the contents of the list to an array.
GetEnumerator
 Gets an enumerator for enumeraring through the list.
IndexOf
 Returns the index of the first matching item in the list.
Insert
 Inserts an item at the specified position.
Parse(String)
 Parses a distance list from a string representation.
Parse(String, IFormatProvider)
 Parses a distance list from a string representation.
Parse(String, IFormatProvider, Distance.UnitType)
 Parses a distance list from a string representation.
Remove
 Removes the specified item.
RemoveAt
 Removes an item at the specified position.
ToArray
 Copies the contents of the list into a new array.
ToString()
 Returns the string representation of the distance list.
 (Overrides ValueType.ToString().)
ToString(IFormatProvider)
 Returns the string representation of the distance list.
ToString(String, IFormatProvider)
 Returns the string representation of the distance list.
ToString(String, IFormatProvider, Distance.UnitType)
 Returns the string representation of the distance list.
Top
See Also
Reference
DistanceList Structure
Tekla.Structures.Datatype Namespace